# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_kubernetes_cluster.k6tests_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "k6tests_cluster" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + current_kubernetes_version                       = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_management_service                           = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = "k6tests-cluster"
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + node_resource_group_id                           = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "k6tests-rg"
      + role_based_access_control_enabled                = (known after apply)
      + service_mesh_profile                             = (known after apply)
      + service_principal                                = (known after apply)
      + storage_profile                                  = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)
    }

  # data.azurerm_monitor_data_collection_endpoint.k6tests_cluster_dce will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_endpoint" "k6tests_cluster_dce" {
      + configuration_access_endpoint = (known after apply)
      + description                   = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = (known after apply)
      + location                      = (known after apply)
      + logs_ingestion_endpoint       = (known after apply)
      + name                          = "k6tests-amw"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "MA_k6tests-amw_norwayeast_managed"
      + tags                          = (known after apply)
    }

  # data.azurerm_monitor_data_collection_rule.k6tests_cluster_dcr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "k6tests_cluster_dcr" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "k6tests-dcr"
      + resource_group_name         = "k6tests-rg"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.foundational.azurerm_kubernetes_cluster.k6tests will be created
  + resource "azurerm_kubernetes_cluster" "k6tests" {
      + automatic_upgrade_channel           = "stable"
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "k6tests-cluster"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + local_account_disabled              = true
      + location                            = "norwayeast"
      + name                                = "k6tests-cluster"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "k6tests-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = true

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "c9c317cc-aec0-4c8b-bdad-b54333686e8a",
            ]
          + azure_rbac_enabled     = false
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + auto_scaling_enabled        = true
          + kubelet_disk_type           = (known after apply)
          + max_count                   = 3
          + max_pods                    = (known after apply)
          + min_count                   = 1
          + name                        = "default"
          + node_count                  = (known after apply)
          + node_labels                 = (known after apply)
          + orchestrator_version        = (known after apply)
          + os_disk_size_gb             = (known after apply)
          + os_disk_type                = "Managed"
          + os_sku                      = (known after apply)
          + scale_down_mode             = "Delete"
          + temporary_name_for_rotation = "tmpdefault"
          + type                        = "VirtualMachineScaleSets"
          + ultra_ssd_enabled           = false
          + vm_size                     = "Standard_D3_v2"
          + workload_runtime            = (known after apply)

          + upgrade_settings {
              + drain_timeout_in_minutes      = 0
              + max_surge                     = "10%"
              + node_soak_duration_in_minutes = 0
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile (known after apply)

      + oms_agent {
          + log_analytics_workspace_id      = (known after apply)
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.foundational.azurerm_kubernetes_cluster_node_pool.prometheus will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "prometheus" {
      + auto_scaling_enabled  = false
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_pods              = (known after apply)
      + mode                  = "User"
      + name                  = "prometheus"
      + node_count            = 1
      + node_labels           = {
          + "workload" = "prometheus"
        }
      + node_taints           = [
          + "workload=prometheus:NoSchedule",
        ]
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D3_v2"
    }

  # module.foundational.azurerm_kubernetes_cluster_node_pool.spot will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "spot" {
      + auto_scaling_enabled  = true
      + eviction_policy       = "Delete"
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 10
      + max_pods              = (known after apply)
      + min_count             = 0
      + mode                  = "User"
      + name                  = "spot"
      + node_count            = 0
      + node_labels           = {
          + "kubernetes.azure.com/scalesetpriority" = "spot"
        }
      + node_taints           = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Spot"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_DS2_v2"
    }

  # module.foundational.azurerm_log_analytics_workspace.k6tests will be created
  + resource "azurerm_log_analytics_workspace" "k6tests" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = 5
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "norwayeast"
      + name                            = "k6tests-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "k6tests-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = (known after apply)
      + workspace_id                    = (known after apply)
    }

  # module.foundational.azurerm_monitor_data_collection_rule.k6tests will be created
  + resource "azurerm_monitor_data_collection_rule" "k6tests" {
      + description         = "DCR for Azure Monitor Container Insights"
      + id                  = (known after apply)
      + immutable_id        = (known after apply)
      + location            = "norwayeast"
      + name                = "k6tests-dcr"
      + resource_group_name = "k6tests-rg"

      + data_flow {
          + destinations = [
              + "ciworkspace",
            ]
          + streams      = [
              + "Microsoft-ContainerLog",
              + "Microsoft-KubeEvents",
              + "Microsoft-KubePodInventory",
              + "Microsoft-KubeNodeInventory",
            ]
        }

      + data_sources {
          + extension {
              + extension_json = jsonencode(
                    {
                      + dataCollectionSettings = {
                          + enableContainerLogV2   = false
                          + interval               = "1m"
                          + namespaceFilteringMode = "Include"
                          + namespaces             = [
                              + "platform",
                              + "dialogporten",
                            ]
                        }
                    }
                )
              + extension_name = "ContainerInsights"
              + name           = "ContainerInsightsExtension"
              + streams        = [
                  + "Microsoft-ContainerLog",
                  + "Microsoft-KubeEvents",
                  + "Microsoft-KubePodInventory",
                  + "Microsoft-KubeNodeInventory",
                ]
            }
        }

      + destinations {
          + log_analytics {
              + name                  = "ciworkspace"
              + workspace_resource_id = (known after apply)
            }
        }
    }

  # module.foundational.azurerm_monitor_data_collection_rule_association.k6tests will be created
  + resource "azurerm_monitor_data_collection_rule_association" "k6tests" {
      + data_collection_rule_id = (known after apply)
      + description             = "Association of container insights data collection rule. Deleting this association will break the data collection for this AKS Cluster."
      + id                      = (known after apply)
      + name                    = "ContainerInsightsExtension"
      + target_resource_id      = (known after apply)
    }

  # module.foundational.azurerm_monitor_workspace.k6tests will be created
  + resource "azurerm_monitor_workspace" "k6tests" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "norwayeast"
      + name                                = "k6tests-amw"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "k6tests-rg"
    }

  # module.foundational.azurerm_resource_group.k6tests will be created
  + resource "azurerm_resource_group" "k6tests" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "k6tests-rg"
    }

  # module.foundational.azurerm_role_assignment.azure_kubernetes_service_cluster_user_role will be created
  + resource "azurerm_role_assignment" "azure_kubernetes_service_cluster_user_role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b95b1fc9-7f21-49c3-8932-07161cd9ac5a"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.services.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.services.data.azurerm_monitor_data_collection_rule.prometheus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "prometheus" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "k6tests-amw"
      + resource_group_name         = "MA_k6tests-amw_norwayeast_managed"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.services.azuread_application.prometheus will be created
  + resource "azuread_application" "prometheus" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "adminservicestest-k6tests-prometheus"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # module.services.azuread_application_federated_identity_credential.prometheus will be created
  + resource "azuread_application_federated_identity_credential" "prometheus" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + display_name   = "adminservicestest-k6tests-prometheus"
      + id             = (known after apply)
      + issuer         = (known after apply)
      + subject        = "system:serviceaccount:monitoring:kube-prometheus-stack-prometheus"
    }

  # module.services.azuread_service_principal.prometheus will be created
  + resource "azuread_service_principal" "prometheus" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # module.services.azurerm_role_assignment.monitoring_metrics_publisher will be created
  + resource "azurerm_role_assignment" "monitoring_metrics_publisher" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Metrics Publisher"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.services.helm_release.k6_operator will be created
  + resource "helm_release" "k6_operator" {
      + atomic                     = false
      + chart                      = "k6-operator"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "k6-operator"
      + namespace                  = "k6-operator-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                installCRDs: true
                
                namespace:
                  create: false
                
                prometheus:
                  enabled: true
            EOT,
        ]
      + verify                     = false
      + version                    = "3.11.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.services.helm_release.kube_prometheus_stack will be created
  + resource "helm_release" "kube_prometheus_stack" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = true
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "70.0.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.services.helm_release.prometheus_operator_crds will be created
  + resource "helm_release" "prometheus_operator_crds" {
      + atomic                     = false
      + chart                      = "prometheus-operator-crds"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus-operator-crds"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "18.0.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.services.helm_release.pyrra will be created
  + resource "helm_release" "pyrra" {
      + atomic                     = false
      + chart                      = "pyrra"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "pyrra"
      + namespace                  = "pyrra-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://rlex.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.14.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "genericRules.enabled"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.helm_release.sealed_secrets will be created
  + resource "helm_release" "sealed_secrets" {
      + atomic                     = false
      + chart                      = "sealed-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sealedsecrets"
      + namespace                  = "sealedsecrets-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://bitnami-labs.github.io/sealed-secrets"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.17.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.services.kubernetes_cluster_role_v1.dev_access will be created
  + resource "kubernetes_cluster_role_v1" "dev_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-access"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "configmaps",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
              + "delete",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "pods",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "k6.io",
            ]
          + resources  = [
              + "testruns",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
              + "create",
              + "update",
              + "patch",
              + "delete",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "secrets",
            ]
          + verbs      = [
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "bitnami.com",
            ]
          + resources  = [
              + "sealedsecrets",
            ]
          + verbs      = [
              + "list",
              + "watch",
              + "delete",
            ]
        }
    }

  # module.services.kubernetes_cluster_role_v1.sp_access will be created
  + resource "kubernetes_cluster_role_v1" "sp_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-sp-access"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "configmaps",
            ]
          + verbs      = [
              + "create",
              + "update",
              + "delete",
              + "get",
            ]
        }
      + rule {
          + api_groups = [
              + "bitnami.com",
            ]
          + resources  = [
              + "sealedsecrets",
            ]
          + verbs      = [
              + "create",
              + "update",
            ]
        }
      + rule {
          + api_groups = [
              + "k6.io",
            ]
          + resources  = [
              + "testruns",
            ]
          + verbs      = [
              + "create",
              + "update",
              + "get",
              + "list",
              + "watch",
              + "delete",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "pods",
            ]
          + verbs      = [
              + "get",
              + "list",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "pods/log",
            ]
          + verbs      = [
              + "get",
              + "list",
            ]
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at22"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at22.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at23"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at23.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at24"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at24.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.prod"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.tt02"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.tt02.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.yt01"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.yt01.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at22"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at22.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at23"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at23.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at24"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at24.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.prod"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.tt02"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.tt02.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.yt01"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.yt01.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_namespace.namespace["dialogporten"] will be created
  + resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_namespace.namespace["platform"] will be created
  + resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_role_binding_v1.dev_access["dialogporten"] will be created
  + resource "kubernetes_role_binding_v1" "dev_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-access"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "dev-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "c403060d-5c8a-41b0-8c19-84fa60d0ce18"
          + namespace = "dialogporten"
        }
    }

  # module.services.kubernetes_role_binding_v1.sp_access["dialogporten"] will be created
  + resource "kubernetes_role_binding_v1" "sp_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-sp-access"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "github-sp-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "b22b612d-9dc5-4f8b-8816-e551749bd19c"
          + namespace = "dialogporten"
        }
    }

Plan: 36 to add, 0 to change, 0 to destroy.

Invalid attribute in provider configuration

  with provider["registry.terraform.io/hashicorp/kubernetes"],
  on providers.tf line 24, in provider "kubernetes":
  24: provider "kubernetes" {

'config_path' refers to an invalid path: "/home/runner/.kube/config": stat
/home/runner/.kube/config: no such file or directory

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/k6tests-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/k6tests-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_k6tests-rg.tfstate.tfplan`